In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from tqdm import tqdm
sns.set_theme()

In [5]:
raw_movielens_folder = "./../data/interim/ml-100k" # even though folder if interim, this file is raw

In [3]:
genres = ["unknown",
"Action",
"Adventure",
"Animation",
"Children",
"Comedy",
"Crime",
"Documentary",
"Drama",
"Fantasy",
"Film-Noir",
"Horror",
"Musical",
"Mystery",
"Romance",
"Sci-Fi",
"Thriller",
"War",
"Western"
]

In [7]:
df_ratings = pd.read_csv(raw_movielens_folder+"/u.data", sep = "\t", header=None, names=['user_id', 'movie_id', 'rating', 'timestamp'], index_col = 0)
df_users = pd.read_csv(raw_movielens_folder+"/u.user", sep='|', header=None, names=['user_id', 'age', 'gender', 'occupation', 'zipcode'], index_col=0)

# in interim this file has replaces || by |
df_movies = pd.read_csv(raw_movielens_folder+"/u.item", sep='|', header=None, names = ["movie_id", "name", "video_date", "link"] + genres, encoding='latin-1', index_col=0)
df_movies.drop(["link"], axis=1, inplace=True) # useless

In [13]:
# drop titles, they are useless. also, i am not going to use release date
df_movies.drop(["name"], inplace=True, axis=1)
df_ratings.drop(["timestamp"], axis=1, inplace=True) # timestamp is useless
df_movies.drop(["video_date"], axis=1, inplace=True) 
df_users.drop(["zipcode"], inplace=True, axis=1)

In [24]:
df_users = pd.get_dummies(df_users, columns=['gender'], dtype="int") # one hot encoding the gender
df_users.drop(["gender_M"], inplace=True, axis=1)
df_users.rename({"gender_F" : "gender"}, axis=1, inplace=True)

In [34]:
df_users = pd.get_dummies(df_users, columns=['occupation'], dtype="int") # one hot encoding the occupation

In [44]:
# Encoding the age into cathegories

bins = [0, 17, 24, 34, 49, float('inf')]

# Define the labels
labels = ['Under 18', '18-24', '25-34', '35-49', 'Above 49']

# Create the new column
df_users['age_group'] = pd.cut(df_users['age'], bins=bins, labels=labels, include_lowest=True)

In [52]:
df_users = pd.get_dummies(df_users, columns=['age_group'], dtype="int")

In [ ]:
df_movies.dropna(inplace=True)

In [ ]:
last_1_columns = df_movies.columns[-1:]

# Cast the last 5 columns to int
df_movies[last_1_columns] = df_movies[last_1_columns].astype(int)

In [66]:
df_ratings.head(1)

         movie_id  rating
user_id
196           242       3

In [67]:
df_users.sample(1)

,age,gender,occupation_administrator,occupation_artist,occupation_doctor,occupation_educator,occupation_engineer,occupation_entertainment,occupation_executive,occupation_healthcare,...,occupation_salesman,occupation_scientist,occupation_student,occupation_technician,occupation_writer,age_group_Under 18,age_group_18-24,age_group_25-34,age_group_35-49,age_group_Above 49
user_id,,,,,,,,,,,,,,,,,,,,,
900,60,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1

In [68]:
df_movies.head(1)

,unknown,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
movie_id,,,,,,,,,,,,,,,,,,,
1,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0

In [71]:
df_ratings.to_csv("./../data/interim/ratings_cleaned.csv")

In [72]:
df_users.to_csv("./../data/interim/users_cleaned.csv")
df_movies.to_csv("./../data/interim/movies_cleaned.csv")